<?php
class questionService 
{
    public static function question($part)
    {   
        $arr =
            array(
                'head'=> array(
                    0 => array(
                        'type' => 1,
                        'question' => 'S1. 访问员记录被访者性别：【单选】',
                        'main' => 1,
                        'answer' => array(
                                1 => '男',
                                2 => '女',
                        )
                    ),
                    1 => array(
                        'type' => 1,
                        'question' => 'S2. 请问您今年的实际年龄是多少岁？【单选】',
                        'main' => 1,
                        'answer' => array(
                                1 => '35岁及以下',
                                2 => '36-45岁',
                                3 => '46-56岁',
                                4 => '56-60岁',
                                5 => '61岁及以上',
                        )
                    ),
                    2 => array(
                        'type' => 1,
                        'question' => 'S3. 请问您的文化程度是？【单选】',
                        'main' => 1,
                        'answer' => array(
                                1 => '硕士研究生以上',
                                2 => '大学（含大专）',
                                3 => '高中/中专',
                                4 => '初中及以下',
                        )
                    ),
                    3 => array(
                        'type' => 1,
                        'question' => 'S4-1. 请问您的政治面貌是？【单选】',
                        'main' => 1,
                        'answer' => array(
                                1 => '中共党员',
                                2 => '共青团员',
                                3 => '民主党派',
                                4 => '群众',
                        ),
                        'event' => array(
                                'jumpType' => 'pass',
                                '1' => 'N',
                                '2' => '1',
                                '3' => '1',
                                '4' => '1',
                        ),
                    ),
                    4 => array(
                        'type' => 1,
                        'question' => 'S4-2.【针对选择中共党员】请问您的党龄是？【单选】',
                        'main' => 1,
                        'answer' => array(
                                1 => '不满1年',
                                2 => '1-5年',
                                3 => '5-10年',
                                4 => '11-20年',
                                5 => '20年以上',
                        ),
                    ),
                    5 => array(
                        'type' => 1,
                        'question' => 'S5. 请问您目前职级属于以下哪种情况？【单选】',
                        'main' => 1,
                        'answer' => array(
                                1 => '省部级以上',
                                2 => '厅局级',
                                3 => '县处级',
                                4 => '乡科级',
                                5 => '乡科级以下',
                        )
                    ),
                    6 => array(
                        'type' => 1,
                        'question' => 'S6. 请问您目前工作单位属于以下哪项？【单选】',
                        'main' => 1,
                        'answer' => array(
                                1 => '青年宫人员',
                                2 => '少年宫人员',
                                3 => '团市委及党校人员',
                                4 => '机关单位人员',
                                5 => '其他人员',
                        )
                    ),
                    7 => array(
                        'type' => 1,
                        'question' => 'S7. 您在所在单位工作是否满半年？【单选】',
                        'main' => 1,
                        'answer' => array(
                                1 => '是',
                                2 => '否',
                        ),
                        'event' => array(
                                'jumpType' => 'out',
                                '1' => 'N',
                                '2' => 'Y',
                            ),
                    ),
            ),
                'base' => array(
                'A部分 制度方面'=> array(
                        0 => array(
                                    'title' => 'A1.您所在单位对以下党建制度开展如何？【单选】（1分代表非常差，5分代表非常好)',
                                    'type' => 2,
                                    'answer' => array(
                                                    1 => '1分',
                                                    2 => '2分',
                                                    3 => '3分',
                                                    4 => '4分',
                                                    5 => '5分',
                                    ),
                                    'question_arr'=> array(
                                        0 => array(
                                            'type' => 1,
                                            'question' => '党员教育制度建设',
                                            'main' => 1,
                                        ),
                                        1 => array(
                                            'type' => 1,
                                            'question' => '党员管理制度建设',
                                            'main' => 1,   
                                        ),
                                        2 => array(
                                            'type' => 1,
                                            'question' => '党费管理制度建设',
                                            'main' => 1, 
                                        ),
                                        3 => array(
                                            'type' => 1,
                                            'question' => '发展党员制度建设',
                                            'main' => 1,
                                        ),
                                        4 => array(
                                            'type' => 1,
                                            'question' => '党员联系服务群众制度建设',
                                            'main' => 1,
                                        ),
                                        5 => array(
                                            'type' => 1,
                                            'question' => '党员联系服务群众制度建设',
                                            'main' => 1,
                                        ), 
                                        6 => array(
                                            'type' => 1,
                                            'question' => '民主评议党员制度建设',
                                            'main' => 1,   
                                        ),                                 )
                        ),
                        1 => array(
                            'type' => 1,
                            'question' => 'A2.您所在单位党组织制度建设情况如何？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '制度健全，得到严格的执行',
                                    2 => '虽然制定，得不到很好的贯彻执行',
                                    3 => '建立了一些制度，但具体规定不清楚',
                                    4 => '可能只是参加问题活动活跃',
                            )
                        ),
                        2 => array(
                            'type' => 3,
                            'question' => 'A3.您认为目前党建工作需要建立哪些规章制度？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '机关党建工作责任制',
                                    2 => '党员经常受教育、永葆先进性长效机制',
                                    3 => '党员和党组织争先创优制度',
                                    4 => '党员联系和服务群众工作机制',
                                    5 => '以上级党委名义制度从根本上解决制约机关党建发展问题的重要文件',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                        3 => array(
                                    'title' => 'A4.您所在单位对以下制度坚持怎么样？【单选】',
                                    'type' => 2,
                                    'answer' => array(
                                                    1 => '坚持很好',
                                                    2 => '坚持较好',
                                                    3 => '偶尔开展',
                                                    4 => '没有开展',
                                                    5 => '不清楚',
                                    ),
                                    'question_arr'=> array(
                                        0 => array(
                                            'type' => 1,
                                            'question' => '开展谈心谈话活动',
                                            'main' => 1,
                                        ),
                                        1 => array(
                                            'type' => 1,
                                            'question' => '党员定期进行思想汇报',
                                            'main' => 1,
                                        ),
                                        2 => array(
                                            'type' => 1,
                                            'question' => '党支部对党员定期进行思想状况分析',
                                            'main' => 1,   
                                        ),
                                        3 => array(
                                            'type' => 1,
                                            'question' => '单位有开展心理疏导与调适相关活动',
                                            'main' => 1, 
                                        ),
                                        4 => array(
                                            'type' => 1,
                                            'question' => '开展个人党性分析',
                                            'main' => 1,   
                                        ),
                                        5 => array(
                                            'type' => 1,
                                            'question' => '召开专题组织生活会和民主生活会',
                                            'main' => 1,  
                                        ), 
                                        6 => array(
                                            'type' => 1,
                                            'question' => '开展征求群众意见活动，对党员开展民主评议',
                                            'main' => 1,   
                                        ),                                 
                                    )
                        ),
                        4 => array(
                            'type' => 1,
                            'question' => 'A5.您认为所在单位机构设置是否合理？【单选】（1分代表非常不合理，5分代表非常合理）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1分',
                                    2 => '2分',
                                    3 => '3分',
                                    4 => '4分',
                                    5 => '5分',
                            )
                        ),
                        5 => array(
                            'type' => 1,
                            'question' => 'A6.您认为所在单位资源分配是否科学？【单选】（1分代表非常不科学，5分代表非常科学）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1分',
                                    2 => '2分',
                                    3 => '3分',
                                    4 => '4分',
                                    5 => '5分',
                            )
                        ),
                ),
                'B部分 思想方面'=> array(
                        0 => array(
                            'type' => 3,
                            'question' => 'B1-1.你认为目前党员干部思想在以下哪些方面做得比较好？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '理想信念强',
                                    2 => '职业认同感强',
                                    3 => '服务意识、公仆意识强',
                                    4 => '单位归属感强',
                                    5 => '工作动力足',
                                    6 => '对深化改革信心足',
                                    7 => '不存在特权思想',
                                    8 => '利益观正确',
                                    9 => '道德高尚',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                        1 => array(
                            'type' => 3,
                            'question' => 'B1-2.你认为目前党员干部思想在以下哪些方面急需改善？【多选，最多选三项】',
                            'max' => 3,
                            'answer' => array(
                                    1 => '理想信念淡化',
                                    2 => '职业认同感不强',
                                    3 => '服务意识、公仆意识不强',
                                    4 => '单位归属感不强',
                                    5 => '工作动力不足',
                                    6 => '对深化改革信心不足',
                                    7 => '存在特权思想',
                                    8 => '利益观扭曲',
                                    9 => '道德缺失',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                        2 => array(
                            'type' => 3,
                            'question' => 'B2-1.您认为目前哪些党员思想建设工作做的比较好？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '三会一课',
                                    2 => '两学一做',
                                    3 => '红色教育',
                                    4 => '党员之家',
                                    5 => '党支部书记集中谈话',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                        3 => array(
                            'type' => 3,
                            'question' => 'B2-2.您认为应该从哪些方面加强党员的思想建设？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '加强马克思主义基本原理学习，打牢思想政治理论基础',
                                    2 => '加强对党的创新理论和上级重要文件会议精神的学习，提高思想政治素养',
                                    3 => '开展形式丰富的教育实践活动，提升理论学习效果',
                                    4 => '建立有效的沟通机制，加强党员干部间的交流互动',
                                    5 => '建立谈心谈话机制，及时掌握党员思想动态',
                                    6 => '发挥先进典型的示范带动作用',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                        4 => array(
                            'type' => 3,
                            'question' => 'B3.您认为当前党员干部思想教育怎样开展才能更有成效？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '教育内容要有针对性、实效性',
                                    2 => '提高教育者的理论水平',
                                    3 => '创新思想教育的方式方法',
                                    4 => '建立一支思想教育骨干队伍',
                                    5 => '教育者身教胜于言教',
                                    6 => '思想教育与制度约束并行',
                                    7 => '开展有意义的活动，提高党员思想',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                        5 => array(
                            'type' => 3,
                            'question' => 'B4.您认为应该通过哪些方式来加强党员干部的能力建设？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '开展有针对性的培训',
                                    2 => '开展读书交流活动',
                                    3 => '加强同时间的沟通交流、分享互助等',
                                    4 => '拓宽与外单位的交流沟通渠道',
                                    5 => '制定行之有效的奖惩机制',
                                    6 => '按照能力素质来分配岗位和工作',
                                    7 => '制定定期考核机制',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                        6 => array(
                            'type' => 1,
                            'question' => 'B5-1.您身边多数党员发挥先锋模范作用的情况如何？【单选】（1分代表非常差，5分代表非常好）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1分',
                                    2 => '2分',
                                    3 => '3分',
                                    4 => '4分',
                                    5 => '5分',
                            )
                        ),
                        7 => array(
                            'type' => 3,
                            'question' => 'B5-2.您认为新时期党员的先锋模范作用主要体现在？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '做好本职工作，争创一流业绩',
                                    2 => '主动承担急难险重任务',
                                    3 => '具有坚定的社会主义、共产主义信念',
                                    4 => '能够正确处理各种利益关系，诚信诚意为人民谋利益',
                                    5 => '说实话、办实事、求实效，关心群众疾苦，维护群众利益',
                                    6 => '具有自觉的组织纪律观念和法制观念',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                ),
                'C部分 党风党纪方面'=> array(
                    0 => array(
                            'type' => 1,
                            'question' => 'C1.您认为当前机关作风如何？【单选】（1分代表非常差，5分代表非常好）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1分',
                                    2 => '2分',
                                    3 => '3分',
                                    4 => '4分',
                                    5 => '5分',
                            )
                    ),
                    1 => array(
                            'type' => 3,
                            'question' => 'C2.新形势下，您认为机关作风存在哪些问题？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '消极应付不作为',
                                    2 => '慵懒散拖慢作为',
                                    3 => '以权谋私乱作为',
                                    4 => '不愿担责不敢为',
                                    5 => '弄虚作假表面文章',
                                    6 => '脱离实际脱离群众',
                            ),
                            'is_custom' => '其他，请说明',    
                    ),
                    3 => array(
                            'type' => 1,
                            'question' => 'C3-1.从配备上，您认为当前机关党务工作队伍现状如何？【单选】（1分代表很弱，5分代表配备很强）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1分',
                                    2 => '2分',
                                    3 => '3分',
                                    4 => '4分',
                                    5 => '5分',
                            )
                    ),
                    4 => array(
                            'type' => 1,
                            'question' => 'C3-2.从队伍稳定上，您认为当前机关党务工作队伍现状如何？【单选】（1分代表很不稳定，5分代表很稳定）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1分',
                                    2 => '2分',
                                    3 => '3分',
                                    4 => '4分',
                                    5 => '5分',
                            )
                    ),
                    5 => array(
                            'type' => 1,
                            'question' => 'C4.您所在单位对党建工作重视吗？【单选】（1分代表非常不重视，5分代表非常重视）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1分',
                                    2 => '2分',
                                    3 => '3分',
                                    4 => '4分',
                                    5 => '5分',
                            )
                    ),
                    6 => array(
                            'type' => 1,
                            'question' => 'C5-1.您所在单位是否存在“不担当、不作为”现象？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '是',
                                    2 => '否',
                            ),
                            'event' => array(
                                'jumpType' => 'pass',
                                '1' => '2',
                                '2' => 'N',
                            ),
                    ),
                    7 => array(
                            'type' => 3,
                            'question' => 'C5-2.您认为目前机关中存在“不担当、不作为”现象的原因有哪些？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '存在畏难情绪，怕担风险',
                                    2 => '干好干坏一个样，工作动力不足',
                                    3 => '部门职责不清晰，互相推诿',
                                    4 => '工作程序复杂，耗时耗力',
                                    5 => '特权思想作祟，漠视群众',
                            ),
                            'is_custom' => '其他，请说明',    
                    ), 
                    8 => array(
                            'type' => 1,
                            'question' => '续C5-2.其中最突出的原因是？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '存在畏难情绪，怕担风险',
                                    2 => '干好干坏一个样，工作动力不足',
                                    3 => '部门职责不清晰，互相推诿',
                                    4 => '工作程序复杂，耗时耗力',
                                    5 => '特权思想作祟，漠视群众',
                            ),
                    ),
                    9 => array(
                            'type' => 3,
                            'question' => 'C5-3.您认为怎么样解决机关中存在的“不担当、不作为”现象？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '简化流程，减少干部“作为”环节',
                                    2 => '畅通对“不作为”行为的监督举报渠道',
                                    3 => '权责明确，减轻干部“作为”思想压力',
                                    4 => '加大对“作为”情况的考核力度',
                                    5 => '健全完善奖惩机制',
                                    6 => '建立容错纠错机制',
                                    7 => '加强机关内部思想教育和作风建设',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                    10 => array(
                            'type' => 3,
                            'question' => 'C6-1.您认为目前坚持从严治党哪些方面做的比较好？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '精神饱满，抓住发展机遇、把握正确的发展方向',
                                    2 => '能力充分，运用马克思主义立场观点方法解决现实问题',
                                    3 => '紧随群众，遵循从群众中来，到群众中去的工作方法',
                                    4 => '制度清明，把制度建设贯穿于全面从严治党全过程',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                    11 => array(
                            'type' => 3,
                            'question' => 'C6-2.您认为坚持从严治党面临哪些问题？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '精神懈怠，没有抓住发展机遇、把握正确的发展方向',
                                    2 => '能力不足，没有运用马克思主义立场观点方法解决现实问题',
                                    3 => '脱离群众，没有遵循从群众中来，到群众中去的工作方法',
                                    4 => '消极腐败，没有把制度建设贯穿于全面从严治党全过程',
                            ),
                            'is_custom' => '其他，请说明',    
                        ),
                    12 => array(
                            'type' => 1,
                            'question' => '续C6-2.其中最突出的原因是？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '精神懈怠，没有抓住发展机遇、把握正确的发展方向',
                                    2 => '能力不足，没有运用马克思主义立场观点方法解决现实问题',
                                    3 => '脱离群众，没有遵循从群众中来，到群众中去的工作方法',
                                    4 => '消极腐败，没有把制度建设贯穿于全面从严治党全过程',
                            ),
                            'is_custom' => '其他，请说明',  
                    ),
                    13 => array(
                            'type' => 3,
                            'question' => 'C7.您认为目前形式主义、官僚主义十项负面清单中哪些问题比较突出？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '学风不正、管理不严',
                                    2 => '文山会海、浮在面上',
                                    3 => '精神懈怠、得过且过',
                                    4 => '软弱涣散、当老好人',
                                    5 => '高高在上、脱离群众',
                                    6 => '不切实际、不求实效',
                                    7 => '弄虚作假、欺上瞒下',
                                    8 => '为官不为、不敢担当',
                                    9 => '急功近利、哗众取宠',
                                    10 => '谄媚阿谀、取悦领导',
                            ),  
                        ),
                    14 => array(
                            'type' => 1,
                            'question' => '续C7.其中最突出的是？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '学风不正、管理不严',
                                    2 => '文山会海、浮在面上',
                                    3 => '精神懈怠、得过且过',
                                    4 => '软弱涣散、当老好人',
                                    5 => '高高在上、脱离群众',
                                    6 => '不切实际、不求实效',
                                    7 => '弄虚作假、欺上瞒下',
                                    8 => '为官不为、不敢担当',
                                    9 => '急功近利、哗众取宠',
                                    10 => '谄媚阿谀、取悦领导',
                            ), 
                    ),
                ),
                'D部分 工作方面'=> array(
                    0 => array(
                            'type' => 1,
                            'question' => 'D1.您现在的工作状态属于以下哪种情况？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '工作得过且过，消极应付',
                                    2 => '工作压力大，忙于应付',
                                    3 => '精神饱满，能积极投入到工作中',
                                    4 => '状态平和，能认真完成工作任务',
                            )
                    ),
                    1 => array(
                            'type' => 1,
                            'question' => 'D2.您是否有“本领恐慌”？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '否',
                                    2 => '是',
                                    3 => '说不清',
                            )
                    ),
                    3 => array(
                            'type' => 1,
                            'question' => 'D3-1. 您认为自身能力在现岗位能否得到发挥？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '充分发挥',
                                    2 => '基本发挥',
                                    3 => '较少发挥',
                                    4 => '没有发挥',
                            ),
                            'event' => array(
                                'jumpType' => 'pass',
                                '1' => 'N',
                                '2' => 'N',
                                '3' => '1',
                                '4' => '1',
                            ),
                    ),
                    4 => array(
                            'type' => 3,
                            'question' => 'D3-2.您能力在现岗位得到发挥体现在哪些方面？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '自身专长和岗位匹配',
                                    2 => '具有发挥能力的机会',
                                    3 => '目前岗位和个人兴趣一致',
                                    4 => '工作充满挑战',
                                    5 => '激励充足，动力足够',
                                    6 => '单位人际关系轻松，很快适应',
                                    7 => '不受管理体制、机制制约',
                            ),  
                            'is_custom' => '其他，请说明', 
                        ),
                    5 => array(
                            'type' => 3,
                            'question' => 'D3-3.您能力在现岗位上难以发挥原因的主要有哪些？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '自身专长和岗位不匹配',
                                    2 => '缺少发挥能力的机会',
                                    3 => '目前岗位和个人兴趣不一致',
                                    4 => '工作缺乏挑战',
                                    5 => '激励不足，动力不够',
                                    6 => '单位人际关系交复杂，难以适应',
                                    7 => '受管理体制、机制制约',
                            ),  
                            'is_custom' => '其他，请说明', 
                        ),
                    6 => array(
                            'type' => 1,
                            'question' => '续D3-3.其中最重要的原因是？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '自身专长和岗位不匹配',
                                    2 => '缺少发挥能力的机会',
                                    3 => '目前岗位和个人兴趣不一致',
                                    4 => '工作缺乏挑战',
                                    5 => '激励不足，动力不够',
                                    6 => '单位人际关系交复杂，难以适应',
                                    7 => '受管理体制、机制制约',
                            ),  
                    ),
                    7 => array(
                            'type' => 1,
                            'question' => 'D4.您最近一个月参加各类会议的次数是？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '5次及以下',
                                    2 => '6-10次',
                                    3 => '11-15次',
                                    4 => '16-20次',
                                    5 => '21次及以上',
                            )
                    ),
                    8 => array(
                            'type' => 1,
                            'question' => 'D5.您最近一个月起草的文稿数量？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '5篇及以下',
                                    2 => '6-10篇',
                                    3 => '11-15篇',
                                    4 => '16-20篇',
                                    5 => '10篇及以上',
                            )
                    ),
                    9 => array(
                            'type' => 1,
                            'question' => 'D6.您所在部门人手是否足够且分配合理？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '足够且分配合理',
                                    2 => '足够，分配不合理',
                                    3 => '不足够，分配不合理',
                            )
                    ),
                    10 => array(
                            'type' => 3,
                            'question' => 'D7.您认为应当通过哪些途径提高办公效率？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '机关部门间统筹协调，避免重复发文',
                                    2 => '深入基层解决实际问题，转变机关工作作风',
                                    3 => '充分利用视频会议、OQ系统等现代科技手段',
                                    4 => '建章立规，严格文件、会议的审批和管理',
                                    5 => '建立科学规范的办文办会程序和制度',
                            ),
                            'is_custom' => '其他，请说明',    
                    ), 
                    11 => array(
                            'type' => 1,
                            'question' => 'D8-1.您在工作中是否感到压力？【单选】（1分代表没有压力，5分代表压力很大）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1分',
                                    2 => '2分',
                                    3 => '3分',
                                    4 => '4分',
                                    5 => '5分',
                            ), 
                    ),
                    12 => array(
                            'type' => 3,
                            'question' => 'D8-2.目前您在工作中压力面临压力来源哪些方面？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '同事间的竞争压力',
                                    2 => '增强能力素质的压力',
                                    3 => '处理复杂人际关系的压力',
                                    4 => '工作要求严标准高任务重的压力',
                                    5 => '不断创新的压力',
                                    6 => '升迁调动的压力',
                                    7 => '社会舆论的压力',
                                    8 => '追究责任的压力',
                            ),
                            'is_custom' => '其他，请说明',    
                    ), 
                    13=> array(
                            'type' => 1,
                            'question' => '续D8-2.最主要压力来源？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '同事间的竞争压力',
                                    2 => '增强能力素质的压力',
                                    3 => '处理复杂人际关系的压力',
                                    4 => '工作要求严标准高任务重的压力',
                                    5 => '不断创新的压力',
                                    6 => '升迁调动的压力',
                                    7 => '社会舆论的压力',
                                    8 => '追究责任的压力',
                            ),  
                    ), 
                    14=> array(
                            'type' => 3,
                            'question' => 'D8-3.您希望单位通过哪些方式来减轻个人工作上的压力？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '增加单位人员编制，扩充人员队伍',
                                    2 => '开展形式丰富、内容多样的文体活动',
                                    3 => '加强业务培训、提高业务素质',
                                    4 => '加强部门之间协助互助',
                                    5 => '尽可能减少人员加班时间',
                                    6 => '提供心理咨询与辅导',
                                    7 => '明确责任制度',
                                    8 => '营造良好的社会舆论氛围',
                            ),
                            'is_custom' => '其他，请说明',    
                    ), 
                    15=> array(
                            'type' => 4,
                            'question' => 'D9.结合自身实际情况，请您对下列影响职务升迁的因素按重要程度排序？【选取五个,按重要程度排序】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '党员身份',
                                    2 => '个人品质',
                                    3 => '工作绩效',
                                    4 => '工作资历和经验',
                                    5 => '机遇',
                                    6 => '家庭背景和关系',
                                    7 => '教育背景',
                                    8 => '科学的晋升制度',
                                    9 => '领导的赏识',
                                    10 => '年龄',
                                    11 => '性别',
                                    12 => '与同事的人际关系',
                                    13 => '专业知识与技能',
                            ),
                            'value'=>array(
                                    '1'=>第一排序,
                                    '2'=>第二排序,
                                    '3'=>第三排序,
                                    '4'=>第四排序,
                                    '5'=>第五排序,
                                ),
                            'num' => 5,    
                    ), 
                    16 => array(
                                    'title' => 'D10-1.您对下面的各项的重要性进行评价？【每一单选】（1分代表非常不重要，5分代表非常重要）',
                                    'type' => 2,
                                    'answer' => array(
                                                    1 => '1',
                                                    2 => '2',
                                                    3 => '3',
                                                    4 => '4',
                                                    5 => '5',
                                    ),
                                    'question_arr'=> array(
                                        0 => array(
                                            'type' => 1,
                                            'question' => '工作环境和条件（软硬件综合评价）',
                                            'main' => 1,
                                        ),
                                        1 => array(
                                            'type' => 1,
                                            'question' => '工作薪酬（含奖金、补贴等）',
                                            'main' => 1,
                                        ),
                                        2 => array(
                                            'type' => 1,
                                            'question' => '与领导关系',
                                            'main' => 1,   
                                        ),
                                        3 => array(
                                            'type' => 1,
                                            'question' => '与同事关系',
                                            'main' => 1, 
                                        ),
                                        4 => array(
                                            'type' => 1,
                                            'question' => '社会声望',
                                            'main' => 1,   
                                        ),
                                        5 => array(
                                            'type' => 1,
                                            'question' => '工作的稳定性',
                                            'main' => 1,  
                                        ), 
                                        6 => array(
                                            'type' => 1,
                                            'question' => '工作中获得的成就感',
                                            'main' => 1,   
                                        ), 
                                        7 => array(
                                            'type' => 1,
                                            'question' => '工作表现和个人业绩对个人进度的影响',
                                            'main' => 1,
                                        ),
                                        8 => array(
                                            'type' => 1,
                                            'question' => '工作加班的补偿机制（如补休、补贴等）',
                                            'main' => 1,
                                        ),
                                        9 => array(
                                            'type' => 1,
                                            'question' => '单位组织活动解压',
                                            'main' => 1,   
                                        ),
                                        10 => array(
                                            'type' => 1,
                                            'question' => '家庭对自己的支持和理解',
                                            'main' => 1, 
                                        ),
                                        11 => array(
                                            'type' => 1,
                                            'question' => '上级领导对下属的鼓励和关系',
                                            'main' => 1,   
                                        ),
                                        12 => array(
                                            'type' => 1,
                                            'question' => '组织给予困难职工的关心和帮助',
                                            'main' => 1,  
                                        ), 
                                        13 => array(
                                            'type' => 1,
                                            'question' => '组织提供学习和深造的机会',
                                            'main' => 1,   
                                        ),  
                                        14 => array(
                                            'type' => 1,
                                            'question' => '有问题及时与上级沟通',
                                            'main' => 1,
                                        ),
                                        15 => array(
                                            'type' => 1,
                                            'question' => '部门领导对待下属的态度',
                                            'main' => 1,
                                        ),
                                        16 => array(
                                            'type' => 1,
                                            'question' => '部门领导组织能力',
                                            'main' => 1,   
                                        ),
                                        17 => array(
                                            'type' => 1,
                                            'question' => '部门民主氛围',
                                            'main' => 1, 
                                        ),
                                        18 => array(
                                            'type' => 1,
                                            'question' => '工会维权能力',
                                            'main' => 1,   
                                        ),
                                        19 => array(
                                            'type' => 1,
                                            'question' => '正常休假的权利能得到有效保证',
                                            'main' => 1,  
                                        ), 
                                        20 => array(
                                            'type' => 1,
                                            'question' => '年度体检的权利能得到有效保证',
                                            'main' => 1,   
                                        ), 
                                        21 => array(
                                            'type' => 1,
                                            'question' => '群众对公职人员工作的配合度',
                                            'main' => 1,
                                        ),
                                        22 => array(
                                            'type' => 1,
                                            'question' => '群众对公职人员的形象评价',
                                            'main' => 1,
                                        ),
                                        23 => array(
                                            'type' => 1,
                                            'question' => '媒体舆论对公职人员的报道',
                                            'main' => 1,   
                                        ),                       
                                    )
                    ),
                    17 => array(
                                    'title' => 'D10-2.您对下面的各项的满意度进行评价？【单选】（1分代表非常不满意，5分代表非常满意）',
                                    'type' => 2,
                                    'answer' => array(
                                                    1 => '1',
                                                    2 => '2',
                                                    3 => '3',
                                                    4 => '4',
                                                    5 => '5',
                                    ),
                                    'question_arr'=> array(
                                        0 => array(
                                            'type' => 1,
                                            'question' => '工作环境和条件（软硬件综合评价）',
                                            'main' => 1,
                                        ),
                                        1 => array(
                                            'type' => 1,
                                            'question' => '工作薪酬（含奖金、补贴等）',
                                            'main' => 1,
                                        ),
                                        2 => array(
                                            'type' => 1,
                                            'question' => '与领导关系',
                                            'main' => 1,   
                                        ),
                                        3 => array(
                                            'type' => 1,
                                            'question' => '与同事关系',
                                            'main' => 1, 
                                        ),
                                        4 => array(
                                            'type' => 1,
                                            'question' => '社会声望',
                                            'main' => 1,   
                                        ),
                                        5 => array(
                                            'type' => 1,
                                            'question' => '工作的稳定性',
                                            'main' => 1,  
                                        ), 
                                        6 => array(
                                            'type' => 1,
                                            'question' => '工作中获得的成就感',
                                            'main' => 1,   
                                        ), 
                                        7 => array(
                                            'type' => 1,
                                            'question' => '工作表现和个人业绩对个人进度的影响',
                                            'main' => 1,
                                        ),
                                        8 => array(
                                            'type' => 1,
                                            'question' => '工作加班的补偿机制（如补休、补贴等）',
                                            'main' => 1,
                                        ),
                                        9 => array(
                                            'type' => 1,
                                            'question' => '单位组织活动解压',
                                            'main' => 1,   
                                        ),
                                        10 => array(
                                            'type' => 1,
                                            'question' => '家庭对自己的支持和理解',
                                            'main' => 1, 
                                        ),
                                        11 => array(
                                            'type' => 1,
                                            'question' => '上级领导对下属的鼓励和关系',
                                            'main' => 1,   
                                        ),
                                        12 => array(
                                            'type' => 1,
                                            'question' => '组织给予困难职工的关心和帮助',
                                            'main' => 1,  
                                        ), 
                                        13 => array(
                                            'type' => 1,
                                            'question' => '组织提供学习和深造的机会',
                                            'main' => 1,   
                                        ),  
                                        14 => array(
                                            'type' => 1,
                                            'question' => '有问题及时与上级沟通',
                                            'main' => 1,
                                        ),
                                        15 => array(
                                            'type' => 1,
                                            'question' => '部门领导对待下属的态度',
                                            'main' => 1,
                                        ),
                                        16 => array(
                                            'type' => 1,
                                            'question' => '部门领导组织能力',
                                            'main' => 1,   
                                        ),
                                        17 => array(
                                            'type' => 1,
                                            'question' => '部门民主氛围',
                                            'main' => 1, 
                                        ),
                                        18 => array(
                                            'type' => 1,
                                            'question' => '工会维权能力',
                                            'main' => 1,   
                                        ),
                                        19 => array(
                                            'type' => 1,
                                            'question' => '正常休假的权利能得到有效保证',
                                            'main' => 1,  
                                        ), 
                                        20 => array(
                                            'type' => 1,
                                            'question' => '年度体检的权利能得到有效保证',
                                            'main' => 1,   
                                        ), 
                                        21 => array(
                                            'type' => 1,
                                            'question' => '群众对公职人员工作的配合度',
                                            'main' => 1,
                                        ),
                                        22 => array(
                                            'type' => 1,
                                            'question' => '群众对公职人员的形象评价',
                                            'main' => 1,
                                        ),
                                        23 => array(
                                            'type' => 1,
                                            'question' => '媒体舆论对公职人员的报道',
                                            'main' => 1,   
                                        ),                       
                                    )
                        ),
                ),
                'E部分 生活方面'=> array(
                    0 => array(
                            'type' => 1,
                            'question' => 'E1.总体来说，您觉得您现在的生活幸福吗？【单选】（1代表很不幸福，5代表很幸福）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                            )
                    ),
                    1 => array(
                            'type' => 1,
                            'question' => 'E2.您对未来充满希望吗？【单选】（1代表没有希望，前途灰暗，5代表充满希望，前途光明）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                            )
                    ),
                    2 => array(
                            'type' => 1,
                            'question' => 'E3.您在生活中感到焦虑吗？【单选】（1代表经常感到焦虑，5代表从不感到焦虑）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                            )
                    ),
                    3 => array(
                            'type' => 1,
                            'question' => 'E4.您觉得自己睡眠如何？【单选】（1代表难以入眠，5代表睡得很好）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                            )
                    ),
                    4 => array(
                            'type' => 1,
                            'question' => 'E5.您在生活中感到孤单寂寞吗？【单选】（1代表经常觉得孤单寂寞，5代表从不觉得孤单寂寞）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                            )
                    ),
                    5 => array(
                            'type' => 1,
                            'question' => 'E6.您在生活中感到情绪低落吗？【单选】（1代表经常感到情绪低落，5代表从不感到情绪低落）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                            )
                    ),
                    6 => array(
                            'type' => 1,
                            'question' => 'E7.您觉得自己目前的身体状况如何？【单选】（1代表非常不好，5代表非常好）',
                            'main' => 1,
                            'answer' => array(
                                    1 => '1',
                                    2 => '2',
                                    3 => '3',
                                    4 => '4',
                                    5 => '5',
                            )
                    ),
                    7 => array(
                            'type' => 1,
                            'question' => 'E8.您的常住居所距离您工作单位的通勤距离有多远？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '5公里及以内',
                                    2 => '6-10公里',
                                    3 => '11-15公里',
                                    4 => '16-20公里',
                                    5 => '21-25公里',
                                    6 => '26-30公里',
                                    7 => '26-30公里以上',
                            ), 
                    ),
                    8 => array(
                            'type' => 1,
                            'question' => 'E9-1.您生育二胎的意愿如何？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '未生育二胎，无计划',
                                    2 => '未生育二胎，有计划',
                                    3 => '已经生育二胎',
                                    4 => '未婚',
                                    5 => '不清楚，暂时没考虑',
                            ),
                            'event' => array(
                                'jumpType' => 'pass',
                                '1' => 'N',
                                '2' => '2',
                                '3' => '2',
                                '4' => '2',
                                '5' => '2',
                            ),
                    ),
                    9=> array(
                            'type' => 3,
                            'question' => 'E9-2.您不考虑生二胎的原因有哪些？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '经济压力大',
                                    2 => '花费时间、成本多',
                                    3 => '小孩无人照顾',
                                    4 => '身体原因（年龄、健康状况等）',
                                    5 => '影响个人工作事业的发展',
                            ),
                            'is_custom' => '其他，请说明',    
                    ), 
                    10 => array(
                            'type' => 1,
                            'question' => '续9-2其中最主要的原因是？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '经济压力大',
                                    2 => '花费时间、成本多',
                                    3 => '小孩无人照顾',
                                    4 => '身体原因（年龄、健康状况等）',
                                    5 => '影响个人工作事业的发展',
                            ),
                            'is_custom' => '其他，请说明', 
                    ),
                    11=> array(
                            'type' => 3,
                            'question' => 'E10.您目前的主要生活压力有哪些？【多选】',
                            'main' => 1,
                            'answer' => array(
                                    1 => '无压力',
                                    2 => '贷款买房',
                                    3 => '赡养父母',
                                    4 => '子女教育',
                                    5 => '身体健康',
                                    6 => '处理复杂的家庭关系',
                                    7 => '夫妻关系',
                                    8=> '提高生活水平需求和经济收入不好的矛盾',
                            ),
                            'is_custom' => '其他，请说明', 
                            'event' => array(
                                'jumpType' => 'pass',
                                '1' => '2',
                                '2' => 'N',
                                '3' => 'N',
                                '4' => 'N',
                                '5' => 'N',
                                '6' => 'N',
                                '7' => 'N',
                                '8' => 'N',
                                '9' => 'N',
                            ),     
                    ), 
                    12=> array(
                            'type' => 1,
                            'question' => '续E10.您目前的主要生活压力有哪些？【单选】',
                            'main' => 1,
                            'answer' => array(
                                    2 => '贷款买房',
                                    3 => '赡养父母',
                                    4 => '子女教育',
                                    5 => '身体健康',
                                    6 => '处理复杂的家庭关系',
                                    7 => '夫妻关系',
                                    8=> '提高生活水平需求和经济收入不好的矛盾',
                            ),
                            'is_custom' => '其他，请说明', 
                             
                    ),
                    13 => array(
                        'type' => 1,
                        'question' => 'E10-1.针对您遇到的各种压力，您采取以下哪种方式倾诉？【单选】',
                        'main' => 1,
                        'answer' => array(
                            1 => '从不向任何人倾诉',
                            2 => '如果朋友询问会主动说出来',
                            3 => '只向少数关系亲密的人倾诉',
                            4 => '向组织汇报思想',
                            5 => '主动向人倾诉自己的烦恼，以获得支持和理解',
                        ),
                        'is_custom' => '其他，请说明',
                    ),
                    14=> array(
                        'type' => 3,
                        'question' => 'E11.近半年来，您正常工作外的时间和节假日主要参加哪些活动/事务？【多选】',
                        'main' => 1,
                        'answer' => array(
                            1 => '体育健身',
                            2 => '读书看报',
                            3 => '文化娱乐（看电影、逛街购物、朋友聚会等）',
                            4 => '旅游踏青',
                            5 => '在家上网或看电视',
                            6 => '照顾老人或小孩',
                            7 => '加班工作',
                            8=> '提高生活水平需求和经济收入不好的矛盾',
                            9=> '志愿服务',
                        ),
                        'is_custom' => '其他，请说明',
                    ),
                ),
                'F部分 机构改革方面'=> array(
                        0 => array(
                            'type' => 1,
                            'question' => 'F1.面对本次机构改革，您所在单位党员干部的思想如何？【单选】（1代表很不稳定，5代表很稳定）',
                            'main' => 1,
                            'answer' => array(
                                1 => '1',
                                2 => '2',
                                3 => '3',
                                4 => '4',
                                5 => '5',
                            )
                        ),
                        1 => array(
                            'type' => 1,
                            'question' => 'F2.您认为本次机构改革对您个人的影响如何？【单选】（1分代表没有影响，5分代表影响很大）',
                            'main' => 1,
                            'answer' => array(
                                1 => '1',
                                2 => '2',
                                3 => '3',
                                4 => '4',
                                5 => '5',
                            )
                        ),
                        2 => array(
                            'type' => 3,
                            'question' => 'F3.本次机构改革，您最关心的问题是？【多选】',
                            'main' => 1,
                            'answer' => array(
                                1 => '个人福利待遇是否受影响',
                                2 => '上班地点是否改变',
                                3 => '个人职位晋升是否受影响',
                                4 => '能否适应新的岗位职责要求',
                                5 => '能否适应新的人际关系',
                                6 => '能否出台改革期间提前退休优惠政策',
                            ),
                            'is_custom' => '其他，请说明',
                        ),
                        3 => array(
                            'type' => 3,
                            'question' => 'F4.本次机构改革，您认为单位应该从哪些方面做好相关工作？【多选】',
                            'main' => 1,
                            'answer' => array(
                                1 => '加强管理，确保工作有序开展',
                                2 => '加强教育，确保人员思想稳定',
                                3 => '加强作风建设，确保不发生违纪问题',
                                4 => '根据工作职能和人员能力素质合理调配岗位',
                                5 => '加强团队建设，促进部门之间有效融合',
                                6 => '针对新岗位开展业务培训',
                                7 => '及时了解人员思想动态，解决工作和生活困难',
                            ),
                            'is_custom' => '其他，请说明',
                        ),
                    ),
                'G部分 开放题'=> array(
                        0 => array(
                            'type' => 5,
                            'question' => 'G1、您对加强和改进党建工作有什么意见或建议？（请用文字描述，如无则填写“无”）',
                        ),
                ),
            )
        );
        return $arr[$part]; 
    }
}
